import {
  View,
  Text,
  Image,
  TouchableOpacity,
  ScrollView,
} from "react-native";
import React, { useLayoutEffect } from "react";
import { StatusBar } from "expo-status-bar";
import { SafeAreaView } from "react-native-safe-area-context";
import { useNavigation } from "@react-navigation/native";
import { Back, BackBox, BackBox2, Hero1, Hero2 } from "../../assets";

const Les3Sub15 = () => {
  const navigation = useNavigation();

  useLayoutEffect(() => {
    navigation.setOptions({
      headerShown: false,
    });
  }, []);

  return (
    <SafeAreaView className="relative flex-1 pt-5 bg-white">
      <ScrollView vertical={true} showsVerticalScrollIndicator={false}>
        {/* Back Button start */}
        <View className="px-3 h-14">
          <View className="flex-row">
            <TouchableOpacity
              className="items-center"
              onPress={() => navigation.navigate("Lesson3")}
            >
              <Image source={BackBox2} width={200} height={30} />
            </TouchableOpacity>
          </View>
        </View>
        {/* Back Button End */}
        {/* Lesson name banner start */}
        <View className="h-20 bg-[#6a1b3b] flex-col justify-center">
          <View className="flex-row px-3">
            <View className="w-2 bg-white h-14"></View>
            <View className="flex-col px-2">
              <Text className="flex flex-col justify-center text-lg font-bold text-white">
                පරිණාමය හා ජීවීන්ගේ විවිධත්වය
              </Text>
              <Text className="flex flex-col justify-center mt-1 text-sm font-semibold text-slate-100">
                පාඩම් අංක 03
              </Text>
            </View>
          </View>
        </View>
        {/* Lesson Banner end */}
        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            ප්ලැටිහෙල්මින්තස් , නෙමටෝඩා හා ඇනලීඩා වංශවලට අයත් ජීවින්ගේ පවතින
            සමාන -අසමානතා සන්සන්දනය කරන්න.
          </Text>
        </View>
        {/* Lesson Category end */}

        {/* Lesson Note Start */}
        <View className="px-3 py-3 mb-3 text-justify text-gray-800">
          <Text className="text-base font-semibold ">
            පැලැටිහෙල්මින්තස් වංශිකයන් නිදැලිවාසී (Planaria) හා පරපෝෂී( පැතැල්ලෝ
            සහ පටි පණුවෝය) වේ.{"\n"}
            {"\n"}කරදිය , මිරිදිය හා තෙත භෞමික ස්ථානවල ජීවත් වේ.{"\n"}
            {"\n"}නෙමටෝඩාවන් වැඩිදෙනෙක් කරදියේ නිදලිවාසීන්ය.{"\n"}
            {"\n"}ටිකදෙනෙක් මිරිදියවාසී හා තෙත් පසේ වාසය කරයි.{"\n"}
            {"\n"}ඇතෙමෙක් සතුන් හා ශාක තුළ පරපෝෂීව වාසය කරයි.{"\n"}
            {"\n"}ඇනෙලීඩාවන් කරදිය , මිරිදිය හා තෙත් භෞමික පරිසරවල වාසය කරයි.
            {"\n"}
            {"\n"}
            ප්ලැටිහෙල්මින්තස් වංශිකයන්ගේ ශීර්ෂණය පිලිබද සලකුණු ඇති නමුත්
            පැහැදිලි නැත.{"\n"}
            {"\n"}නෙමටෝඩාවන්ට පැහැදිලි ශීර්ෂණයක් නැත.{"\n"}
            {"\n"}ශීර්ෂණය පෙන්නුම් කරන මුල්ම සත්ත්ව ආකාරය ඇනලීඩා වේ.{"\n"}
            {"\n"}
            ප්ලැටිහෙල්මින්තස් , නෙමටෝඩා හා ඇනලීඩා වංශ තුනටම අයත් ජීවීන්
            ත්‍රිපස්තරිකය.{"\n"}
            {"\n"}ප්ලැටිහෙල්මින්තස් වංශිකයන්ගේ සමහරුන්ට සත්‍ය ඛණ්ඩනයක් නැත.
            {"\n"}
            {"\n"}
            නෙමටෝඩාවන් ඛණ්ඩනයක් නොපෙන්වයි.{"\n"}
            {"\n"}ඇනෙලීඩාවන් ඛණ්ඩනය වූ දේහ දරයි.{"\n"}
            {"\n"}ප්ලැටිහෙල්මින්තස් වංශිකයන් අසීලෝමිකය.{"\n"}
            {"\n"}නෙමටෝඩාවන් ව්‍යාජ සීලෝමිකයෝය.{"\n"}
            {"\n"}මුලින්ම සත්‍ය සීලෝමය හමුවන්නේ ඇනලීඩාවන්ගේය.{"\n"}
            {"\n"}
            ප්ලැටිහෙල්මින්තස් වංශිකයන්ගේ ශරීරය පෘෂ්ඨෝදරීයව පැතැලි වේ.{"\n"}
            {"\n"}
            නෙමටෝඩාවන් දෙකෙළෙවරින් සිහින්ව යන සිලින්ඩරාකාර දේහ දරයි.{"\n"}
            {"\n"}
            අන්වීක්ෂීය සිට මහේක්ෂීය තෙක් දේහ ප්‍රමාණය වෙනස් වන සුලුය.{"\n"}
            {"\n"}දේහයේ පූර්ව කෙළවර සංවේදී පිටිකා ඇත.{"\n"}
            {"\n"}දේහය දැඩි උච්චර්මයකින් ආවරණය වී ඇත.{"\n"}
            {"\n"}ඇනලීඩාවන් සිලින්ඩරාකාර දේහ දරයි.{"\n"}
            {"\n"}ප්ලැටිහෙල්මින්තස් වංශිකයන් අස්ම්පූර්ණ ජීරණ පද්ධතියක් දරයි.
            {"\n"}
            {"\n"}
            මුඛයක් පමණක් සහිතය / හුදයක් රහිතය.{"\n"}
            {"\n"}ආහාර ජීරණයට ශාඛනය වූ ආමාශවාහිනී කුහරයක් ඇත.{"\n"}
            {"\n"}සමහරුන්ට බිහිතලනය කළ හැකි ග්‍රසනිකාවක් ඇත.{"\n"}
            {"\n"}නෙමටෝඩාවන්ට සම්පූර්ණ ආහාර මාර්ගයක් ඇත.{"\n"}
            {"\n"}ඇනලීඩාවන්ට සම්පූර්ණ ආහාර මාර්ගයක් ඇත.{"\n"}
            {"\n"}මද වශයෙන් සංකීර්ණ ස්නායු හා සංවේදක පද්ධතියක් මුලින්ම හමුවන්නේ
            ප්ලැටිහෙල්මින්තස් වංශයේය. {"\n"}
            {"\n"}පූර්ව ගැංග්ලියා යුගලක් හා අන්වායාම ස්නායු රැහැන් දෙකක් මධ්‍ය
            ස්නායු පද්ධතියට අයත්ය.{"\n"}
            {"\n"}නෙමටෝඩාවන්ට ස්නායු වලයක් හා අන්වායාම ස්නායු රජ්ජුවක් ඇත.{"\n"}
            {"\n"}
            ඇනලීඩාවන්ට හොදින් වැඩුණු ස්නායු පද්ධතියක් ඇත.{"\n"}
            {"\n"}එය පෘෂ්ඨීය මස්තිෂ්ක ගැංග්ලියමෙන් උදරීය ස්නායු රැහැනකින් හා
            වලයාකාර සම්බන්ධක වලින් සමන්විතය. {"\n"}
            {"\n"}පැලැටිහෙල්මින්තස් හා නෙමටෝඩා වංශිකයන් රුධිර සංසරණ හෝ ශ්වසන
            පද්ධති නැත.{"\n"}
            {"\n"}දේහ බිත්තිය හරහා සරල විසරණයෙන් වායු හුවමාරුව සිදු වේ.{"\n"}
            {"\n"}
            ඇනලීඩාවන් ශ්වනය සදහා ජල්ක්ලෝම හා දේහාවරණය යොදා ගනී.{"\n"}
            {"\n"}ඇනලීඩාවන්ට පාර්ශ්වික හෘද සහිත සංවෘත රුධිර සංසරණ පද්ධතියක්
            පවතී.{"\n"}
            {"\n"}ප්ලැටිහෙල්මින්තස් වංශයේ නිදලිවාසීන්ට සංචරණය සදහා ආධාර වන
            පක්ෂ්ම ඇත.{"\n"}
            {"\n"}නෙමටෝඩාවන්ගේ විශේෂිත සංචරණ ව්‍යුහ නැති ඇතර දේහ බිත්තියේ
            අන්වායම පේෂි සංචරණයට ආධාර කරයි.{"\n"}
            {"\n"}ඇනලීඩාවන්ගේ අංශපාදිකා ශ්වනයට හා සංචරණයට ආධාර වේ.{"\n"}
            {"\n"}බාහිර පරපෝෂී ආකාරවල සංචරණයට හා අධිග්‍රහණයට චූෂකර ආධාර වේ.
            {"\n"}
            {"\n"}
            පැලැටිහෙල්මින්තස් වංශිකයන්ගේ නයිට්‍රජනීය බහිස්ස්‍රාවී පද්ධතිය
            ප්‍රාග් වෘක්කිකා වලින් සමන්විත වේ.{"\n"}
            {"\n"}සිලුබල්බ නම් පක්ෂ්මධර ව්‍යුහයක් සහිත නාලිකා ජාලයකි.{"\n"}
            {"\n"}දැඩි කෙදි සංචරණයට ආධාර වේ.{"\n"}
            {"\n"}ආස්‍රැතියක තුල්‍යතාවය පවත්වා ගැනීමට භාවිතා කරයි.{"\n"}
            {"\n"}
            නෙමටෝඩාවන්ගේ විකසනය වූ බහිස්ස්‍රාවී ව්‍යුහ නැත.{"\n"}
            {"\n"}දේහ බිත්තියේ බහිස්ස්‍රාවී ජිද්‍ර වලින් සමන්විත අන්වායාම
            බහිස්ස්‍රාවී ප්‍රණාල යුගලක් ඇති අතර.{"\n"}
            {"\n"}ඇතැම් සතුන් රෙනට් සෛල දරයි.{"\n"}
            {"\n"}ඇනලීඩාවන් බහිස්ස්‍රාවය පශ්ච වෘක්කිකා මගින් සිදු වේ.{"\n"}
            {"\n"}ඇතැම් ප්ලැටිහෙල්මින්තස් වංශිකයන් පුනර්වර්ධනය මගින් අලිංගික
            ප්‍රජනනය සිදුකරයි.{"\n"}
            {"\n"}පටිපණුවා වැනි ආකාර කිහිපයක් හැර සියලු දෙනා ද්විලිංගිකයයි.
            {"\n"}
            {"\n"}
            අනෙක් සාමාජිකයන් අභ්‍යන්තරව පරසංචේනය කරයි.{"\n"}
            {"\n"}පරපෝෂී ආකාරවල කීට අවධි ඇත.{"\n"}
            {"\n"}නිදලිවාසීහු කීට අවධි රහිතව විකසනය වේ.{"\n"}
            {"\n"}නෙමටෝඩාවන්ගේ ලිංගික ප්‍රජනනය අභ්‍යන්තර සංසේචනයෙන් සිදු වේ.
            {"\n"}
            {"\n"}
            ගැහැනු හා පිරිමි සත්තු වෙති.{"\n"}
            {"\n"}ගැහැනු සත්තු ප්‍රමාණයෙන් විශාලය.{"\n"}
            {"\n"}ඇනලීඩාවන්ගේ ලිංගික ප්‍රජනනයට ප්‍රණාල සහිත ප්‍රජනක පද්ධතියක්
            පවතී.{"\n"}
            {"\n"}සංසේචනය අභ්‍යන්තර හා බාහිරව සිදුවේ.{"\n"}
            {"\n"}අංකුරණය පුනර්වර්ධනය දැකිය හැක.{"\n"}
            {"\n"}ඒකලිංගික මෙන්ම ද්විලිංගික සතුන්ද සිටී.
          </Text>
        </View>

        {/* Lesson Note End */}
      </ScrollView>
      <StatusBar style="dark" />
    </SafeAreaView>
  );
};

export default Les3Sub15;
