import {
  View,
  Text,
  Image,
  TouchableOpacity,
  ScrollView,
} from "react-native";
import React, { useLayoutEffect } from "react";
import { StatusBar } from "expo-status-bar";
import { SafeAreaView } from "react-native-safe-area-context";
import { useNavigation } from "@react-navigation/native";
import { Back, BackBox, BackBox2, Hero1, Hero2 } from "../../assets";

const Les4Sub8 = () => {
  const navigation = useNavigation();

  useLayoutEffect(() => {
    navigation.setOptions({
      headerShown: false,
    });
  }, []);

  return (
    <SafeAreaView className="relative flex-1 pt-5 bg-white">
      <ScrollView vertical={true} showsVerticalScrollIndicator={false}>
        {/* Back Button start */}
        <View className="px-3 h-14">
          <View className="flex-row">
            <TouchableOpacity
              className="items-center"
              onPress={() => navigation.navigate("Lesson4")}
            >
              <Image source={BackBox2} width={200} height={30} />
            </TouchableOpacity>
          </View>
        </View>
        {/* Back Button End */}

        {/* Lesson name banner start */}
        <View className="h-20 bg-[#3a301c] flex-col justify-center">
          <View className="flex-row px-3">
            <View className="w-2 bg-white h-14"></View>
            <View className="flex-col px-2">
              <Text className="flex flex-col justify-center text-lg font-bold text-white">
                ශාක ආකාරය හා ක්‍රියාකාරිත්වය
              </Text>
              <Text className="flex flex-col justify-center mt-1 text-sm font-semibold text-slate-100">
                පාඩම් අංක 04
              </Text>
            </View>
          </View>
        </View>
        {/* Lesson Banner end */}

        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            ද්විබීජ පත්‍රී ශාක කදෙහි ද්විතීක වර්ධනය මගින් පරිණත අවධිය ට එළඹෙන
            අයුරු විස්තර කරන්න.
          </Text>
        </View>
        {/* Lesson Category end */}

        {/* Lesson Note Start */}
        <View className="px-3 py-3 mt-2 mb-3 text-justify text-gray-800">
          <Text className="text-base font-semibold ">
            පාර්ශ්වික විභාජක මගින් නිපදවන නව සෛල හේතුවෙන් ශාක කදන්වල විශ්කම්භය
            වැඩිවීම ද්විතීක වර්ධනය යි.{"\n"}
            {"\n"}මෙය සියලුම විවෘත බීජක ශාක විශේෂ හා බොහෝ දීවීබීජ පත්‍රී ශාක
            විශේෂවල කදන්වල සිදුවේ.{"\n"}
            {"\n"}මෙහිදී පාර්ශවික විභාජක වන සනාල කැම්බියම හා,වල්ක කැම්බියම මගින්
            නව සෛල හා පටක නිපදවයි.{"\n"}
            {"\n"}සනාල කැම්බියම මගින් ප්‍රාථමික ශෛලම දෙසට ද්විතීක ශෛලම (කාෂ්ඨය)
            හා ප්‍රාථමික ප්ලෝයම දෙසට ද්විතීයික ප්ලෝයම නිපදවයි.{"\n"}
            {"\n"}ඉන් කදේ සනාල ප්‍රවාහය වැඩිවේ.{"\n"}
            {"\n"}ශාක කදට වැඩි සන්ධාරක ශක්තියක් ලැබේ.{"\n"}
            {"\n"}වල්ක කැම්බියම මගින් ප්‍රධාන වශයෙන් සුබෙරින් වලින් සෛල බිත්ති
            ඝනකම් වූ තද ඝන පිටත ආවරණයක් සාදයි.{"\n"}
            {"\n"}ඉන් ශාක කඳෙන් සිදුවන ජල හානිය වළක්වයි.{"\n"}
            {"\n"}එසේ ම කෘමීන්, දිලීර, හා බැක්ටීරියාවන් ගෙන් සිදුවන ආක්‍රමණ ද
            වළක්වයි.{"\n"}
            {"\n"}කාෂ්ඨීය ශාක වල ප්‍රාථමික වර්ධනය හා ද්විතීක වර්ධනය එකවර සිදුවේ.
            {"\n"}
            {"\n"}ශාකයේ ළපටි කොටස් වල ප්‍රාථමික වර්ධනය මගින් ඇති කරන නව සෛල
            මගින් ශාක කඳන් දිගු වේ.{"\n"}
            {"\n"}ද්වීතීයික වර්ධනයේ දී ප්‍රාථමික වර්ධනය නැවති ඇති පරිණත ශාක කඳන්
            වල විශ්කම්භය වැඩි කරයි.{"\n"}
            {"\n"}සනාල කැම්බියම ක්‍රියාකාරිත්වය හේතුවෙන් ද්විතීක සනාල පටක
            නිපදවයි.{"\n"}
            {"\n"}දර්ශීය කාෂ්ඨීය ශාක කඳක ,සනාල කැම්බියම විභේදනය නොවූ තනි සෛල
            ස්ථරයකි.{"\n"}
            {"\n"}එය අඛණ්ඩ සිලින්ඩරයක් ලෙස පවතී.{"\n"}
            {"\n"}මෙය මජ්ජාව ට හා ප්‍රාථමික සෛලමය ට පිටතින් හා,ප්‍රාථමික
            ප්ලෝයමයට හා බාහිකය ට ඇතුළතින් පිහිටයි.{"\n"}
            {"\n"}මෙහි ඇති විභාජක සෛල විභාජනය වී සනාල කැම්බියම පරිදිය වැඩි වේ.
            {"\n"}
            {"\n"}ද්වීතික ශෛලම කැම්බියමෙන් ඇතුලට ද,ද්විතීක ප්ලෝයම කැම්බියමෙන්
            පිටතටද එකතුවෙ.{"\n"}
            {"\n"}හරස්කඩකද සනාල කැම්බියම මවුලික වල යක් ලෙස දිස්වේ.{"\n"}
            {"\n"}සමහර මවුලික සෛල දිගැටි හැඩයක් ගනියි.{"\n"}
            {"\n"}ඒවායේ දික්අක්ෂය කදේ හෝ මුලේ හෝ අක්ෂයට සමාන්තරව දිශානත වී ඇත.
            {"\n"}
            {"\n"}මින් සෛලම පටකයේ වාහකාභ ,වාහිනි ඒකක ,මෘදුස්තර හා ශෛලම තන්තු
            නිපදවයි.{"\n"}
            {"\n"}ප්ලෝයම පටකයේ පෙනේර නළ ඒකක,සහචර සෛල ප්ලෝයම තන්තු හා මෘදුස්තර
            නිපදවයි.{"\n"}
            {"\n"}සනාල කැම්බියම පිහිටි අනිත් මවුලික සෛල කෙටි වේ.{"\n"}
            {"\n"}ඒවා කදේ හා මුලේ අක්ෂයට ලම්භකව දිශානත වී ඇත.{"\n"}
            {"\n"}එමගින් සනාල කිරණ සාදයි.{"\n"}
            {"\n"}ඒවා ප්‍රධාන වශයෙන් ද්විතියික ශෛලම හා ද්විතීක ප්ලෝයම එකිනෙක
            සම්බන්ධ කරන මෘදුස්තර සෛල පිහිටයි.{"\n"}
            {"\n"}එම සෛල කාබෝහයිඩේට සංචිත කිරීමටත්,තුවාල සුව කිරීමේ දී ද ආධාර
            වේ.{"\n"}
            {"\n"}ද්විතීක වර්ධනය වසර ගණනාවක් පුරා අඛණ්ඩව සිදුවීමේදී ද්විතියික
            ශෛලම ස්තර ලෙස තැන්පත් වේ.{"\n"}
            {"\n"}ද්විතීක ශෛලම සෛලවල බිත්ති තදින් ලිහ්නිභවනය වී ඇත.{"\n"}
            {"\n"}එය ශාකයෙ කාෂ්ඨයෙහි තද බවට හා ශක්තිමත් බවට දායක වේ.
            {"\n"}
            {"\n"}ද්විතියික වර්ධනයේ මුල් අවධිවල කඳෙහි අපිචර්මය ඉවතට තල්ලුවී
            පිපිරී වියළී ගැලවේ.{"\n"}
            {"\n"}වල්ක කැම්බියම යනු කදෙහි බාහිකයේ බාහිර ස්තරයෙන් හටගන්නා,
            {"\n"}
            {"\n"}විභාජනයට ලක්විය හැකි සෛල සහිත සිලින්ඩරය කි.{"\n"}
            {"\n"}වල්ක කැම්බියම මගින් පිටතට වල්ගය සාදයි.{"\n"}
            {"\n"}වල්ක කැම්බියම හා ඉන් නිපදවන පටක එක්වගත් විට එය පරිචර්මය ලෙස
            හඳුන්වයි.{"\n"}
            {"\n"}වල්ක සෛල පරිණත වීමේදී ඒවායේ සෛල බිත්ති තුළ සුබේරින් නැමති
            ජලභීතික ඉටි විශේෂයක් තැන්පත් වීමෙන් ඒවා අජීවී සෛල බවට පත්වෙයි.
            {"\n"}
            {"\n"}වල්ක පටක,බාධකයක් ලෙස ක්‍රියා කරමින් ශාක කඳෙන් වන ජල හානිය
            වළක්වයි.{"\n"}
            {"\n"}භෞතික හානි හා ව්‍යාධිජනකයන්ගෙන් සිදුවන හානි ද වළක්වයි.{"\n"}
            {"\n"}
            එකෙ එක් වල්ක කැම්බියම හා එමගින් නිපදවන සියලු පටක එක්ව පරිචර්මය නම්
            ස්තරයක් සාදන අතර ඒ ජලයට හා වායු වලට අපාරගම්‍ය වෙයි.{"\n"}
            {"\n"}මේ නිසා පරිචර්මයේ තිරස් පැලුම් ලෙස වා සිදුරු නම් කුඩා සිදුරු
            ඇත.{"\n"}
            {"\n"}ඒවා ලිහිල්ව සැකසුණු වල්ක සෛලවලින් ඇතිවේ.{"\n"}
            {"\n"}වායු හුවමාරුවට උදව් වේ.{"\n"}
            {"\n"}තව දුරටත් ශාක කදෙහි වර්ධනය සිදුවන විට වල්ක කැම්බියම ස්තරය බිඳී
            යන අතර, ඒවායේ විභාජක හැකියාව නැති වී ඒවා වල්ක සෛල බවට පත්වේ.{"\n"}
            {"\n"}මේ නිසා නව වල්ක කැම්බියමක් ඇතුළතින් ඇති වීම ආරම්භ කරයි.
            {"\n"}
            {"\n"}එමගින් නව නව පරිචර්මීය ස්තරයක් ඇති කරයි.{"\n"}
            {"\n"}බොහෝ ශාක කඳන් වල මෙලෙස නව සෛල ඇතිවීමේ දී වල්කයේ පිටත ප්‍රදේශය
            ප්‍රදේශය පිපිරී ගැලවී ඉවත් ව යයි.{"\n"}
            {"\n"}සනාල කැම්බියම හා වල්ක කැම්බියම මගින් නිපදවනු ලබන නව පටක නිසා
            මෙලෙස ශාක කඳ එහි වට ප්‍රමාණය වැඩිවීම ද්විතියික වර්ධනයේදී සිදුවේ.
          </Text>
        </View>
        {/* Lesson Note End */}

        {/* Lesson Note End */}
      </ScrollView>
      <StatusBar style="dark" />
    </SafeAreaView>
  );
};

export default Les4Sub8;
