import {
  View,
  Text,
  Image,
  TouchableOpacity,
  ScrollView,
} from "react-native";
import React, { useLayoutEffect } from "react";
import { StatusBar } from "expo-status-bar";
import { SafeAreaView } from "react-native-safe-area-context";
import { useNavigation } from "@react-navigation/native";
import { Back, BackBox, BackBox2, Hero1, Hero2 } from "../../assets";

const Les4Sub14 = () => {
  const navigation = useNavigation();

  useLayoutEffect(() => {
    navigation.setOptions({
      headerShown: false,
    });
  }, []);

  return (
    <SafeAreaView className="relative flex-1 pt-5 bg-white">
      <ScrollView vertical={true} showsVerticalScrollIndicator={false}>
        {/* Back Button start */}
        <View className="px-3 h-14">
          <View className="flex-row">
            <TouchableOpacity
              className="items-center"
              onPress={() => navigation.navigate("Lesson4")}
            >
              <Image source={BackBox2} width={200} height={30} />
            </TouchableOpacity>
          </View>
        </View>
        {/* Back Button End */}

        {/* Lesson name banner start */}
        <View className="h-20 bg-[#3a301c] flex-col justify-center">
          <View className="flex-row px-3">
            <View className="w-2 bg-white h-14"></View>
            <View className="flex-col px-2">
              <Text className="flex flex-col justify-center text-lg font-bold text-white">
                ශාක ආකාරය හා ක්‍රියාකාරිත්වය
              </Text>
              <Text className="flex flex-col justify-center mt-1 text-sm font-semibold text-slate-100">
                පාඩම් අංක 04
              </Text>
            </View>
          </View>
        </View>
        {/* Lesson Banner end */}

        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            පාංශු ද්‍රාවණයේ සිට ජලය අවශෝෂණය වීම්ත්, එම ජලය මුලෙහි ශෛලම දක්වා
            පරිවහනය වීමත් සිදුවන අයුරු විස්තර කරන්න
          </Text>
        </View>
        {/* Lesson Category end */}

        {/* Lesson Note Start */}
        <View className="px-3 py-3 mt-2 mb-3 text-justify text-gray-800">
          <Text className="text-base font-semibold ">
            මූලාග්‍රයට ආසන්නව ඇති මුලෙහි සෛලවලින් ප්‍රධාන වශයෙන් ජලය හා ඛනිජ
            අවශෝෂණය කරයි.{"\n"}
            {"\n"}මෙහි ඇති අපිචර්මීය සෛල ජලයට වඩාත් පාරගම්‍ය වේ.{"\n"}
            {"\n"}බොහෝ සෛල මූලකේශ බවට විභේදනය වී ඇත.{"\n"}
            {"\n"}මුල් මගින් ජලය අවශෝෂණය වැඩි දායකත්වයක් ලබාදෙන්නේ මූලකේශ මගින්
            මුලේ පෘෂ්ටික වර්ගඵලය වැඩිවීමෙනි.{"\n"}
            {"\n"}පස් අංශුවලට තදින් බැදී නැති ජල අණු හා එහි දියවූ ඛනිජ අයන සහිත
            පාංශු ද්‍රාවණය මූල කේෂ මගින් අවශෝෂණය කරයි.{"\n"}
            {"\n"}මේ අවශෝෂණය ප්ලාස්ම පටලය හරහා සිදුවේ.{"\n"}
            {"\n"}ජලය මූල්කේෂ තුලට සාන්ද්‍රණ අණුක්‍රමන ඔස්සේ අක්‍රීයව ආස්‍රැතිය
            මගින් ඇතුලු වේ.{"\n"}
            {"\n"}මූලකේශ තුල අඩංගු ඛනිජ අයන සාන්ද්‍රණය පාංශු ද්‍රාවණයේ
            සාන්ද්‍රණයට වඩා වැඩිය.{"\n"}
            {"\n"}මූලකේශ තුළ අඩංගු K+ අයන සාන්ද්‍රණය පාංශු ද්‍රාවණයේ K+
            සාන්ද්‍රණයට වඩා සිය ගුණයකින් පමණ වැඩිය.{"\n"}
            {"\n"}මේ නිසා ඛනිජ අයන අවශෝෂණය සක්‍රිය පරිවහනය මගින් සාන්ද්‍රණ
            අණුක්‍රමණයට එරෙහිව සිදුවේ.{"\n"}
            {"\n"}පාංශු ද්‍රාවණය අපිචර්මීය සෛලවල ජලකාමී සෛල බිත්ති තුලට ඇතුලු
            වේ.{"\n"}
            {"\n"}එය සෛල බිත්ති හා බහිස්සෛලීය අවකාශ ඔස්සේ ගමන් කරයි.{"\n"}
            {"\n"}
            අනතුරුව නිදහසේ මුලෙහි බාහිකය තුළට ගමන් කරයි.{"\n"}
            {"\n"}පසෙහි සිට මුලෙහි බාහිකය දක්වා ඇතුළු වූ ජලය හා ඛනිජ මුලෙහි ශෛලම
            දක්වා පරිවහනය අරීය ජල පරිවහනයයි.{"\n"}
            {"\n"}බාහිකයේ ඇතුලතම සෛල ස්තරය අන්තශ්චර්මයයි.{"\n"}
            {"\n"}බාහිකයේ සිට සනාල සිලින්ඩරයට ඛනිජ වරනීයව ඇතුළු කරන ගමන් මාර්ගයේ
            අවසන් පිරික්සුම් ලක්ෂ්‍යයයි.{"\n"}
            {"\n"}සෛල බිත්ති අවකාශ ඔස්සේ හා බහිස්සෛලීය අවකාශ ඔස්සේ මුලට ඇතුළත්
            වූ හා එනු ලබන, සියලුම ද්‍රව්‍ය අන්තශ්චර්මයේ සෛලවල ප්ලාස්ම පටල හරහා
            ගමන් කළ යුතුය.{"\n"}
            {"\n"}මේ නිසා ශාක දේහයේ අනවශ්‍ය ද්‍රව්‍ය වරණීය ලෙස බැහැර කරයි.{"\n"}
            {"\n"}
            අරීය පරිවහනයේදී මාර්ග තුනක් භාවිතා වේ.{"\n"}
            {"\n"}ඇපොප්ලාස්ට මාර්ගය, සිම්ප්ලාස්ට මාර්ගය හා පටල හරහා සම්ප්‍රේෂණ
            මාර්ගය වේ.{"\n"}
            {"\n"}ඇපොප්ලාස්ට මාර්ගය: සජීවී සෛලයක ප්ලාස්ම පටලය පිටතින් ඇති සියලු
            දේ එනම් සෛල බිත්තිය{"\n"}
            {"\n"}බහිස්සෛලීය අවකාශය: ශෛලමය වාහිනී හා වාහකාභ වැනි අජීවී සෛලවල
            අභ්‍යන්තරය ඇපොප්ලාස්ටයට අයත් වේ.ජලය හා එහි ද්‍රව්‍ය සන්තතික
            සෛලබිත්ති අවකාශය හා බහිස්සෛලීය අවකාශ ඔස්සේ ගලා යයි.එය ඇපොප්ලාස්ට
            මාර්ගය ලෙස හදුන්වයි.මූලකේශ වල ජලකාමී සෛල බිත්තිමගින් පාංශු ද්‍රාවණය
            ඉහළට ගැනීම ද ඇපොප්ලාස්ටය සදහා ප්‍රවේශ මාර්ගය සපයයි එවිට ජලය හා ඛනිජ
            මේ සෛලබිත්ති පූරකය තුලින් හා බහිස්සෛලීය අවකාශය ඔස්සේ බාහිකය තුළට
            විසරණය වේ.අන්තශ්චර්මීය සෛලවල තිරස් හා අරීය බිත්තිවල පවතින කැස්පාර්
            පටිය නම් බාධකය මගින් අන්තශ්චර්මය, ඇපොප්ලාස්ට මාර්ගය අවහිර කරයි.මේ
            කැස්පාර් පටිය සුබෙරීන් වලින් සෑදී ඇත.එය ජලයට හා ඛනිජ ලවණ වලට
            අපාරගම්‍ය වේ.ඒ නිසා ජලය හා ඛනිජ අන්තශ්චර්මය තුළින් ඇපොප්ලාස්ටය ඔස්සේ
            සනාල සිලින්ඩරයට ඇතුළු විය නොහැක.ජලය හා ඛනිජ සනාල පටකයට ඇතුළුවීමට පෙර
            වරණීය පාරගම්‍යතාව යෙන් යුතු ප්ලාස්මපටලය හරහා ගමන් කරයි.අනවශ්‍ය
            ද්‍රව්‍ය හා විෂ ද්‍රව්‍ය සනාල පටකයට ඇතුළු වීමෙන් වළකයි.එසේම
            අන්තශ්චර්මය මගින් ශෛලමයට ඒකරාශි වන ද්‍රව්‍ය ආපසු පාංශු ද්‍රාවනයට
            වෑස්සීද වළක්වයි. සිම්පාල්ස්ට මාර්ගය සියලු සජීවී සෛල වල සම්පූර්ණ
            සයිටොසොලය හා ඒවා එකිනෙක බැදී ඇති සෛලප්ලාස්ම නාලිකාව වන ප්ලාස්ම බන්ධ
            යන සියල්ල අයත් වේ.සිම්ප්ලාස්ට මාර්ගය මගින් ජලය හා ජලයේ දිය වූ
            ද්‍රව්‍ය සෛල ප්ලාස්ම පූරකය ඔස්සේ සන්තතිකව ගමන් කරයි.ද්‍රව්‍ය මුලින්ම
            ශාකය තුළට ඇතුළු වනවිට ඒවා එක් වරක්වත් ප්ලාස්ම පටලය හරහා ගමන් කළ
            යුතුය.එක් සෛල ඒකට ඇතුළු වූ පසුව ඒවාසෛලයෙන් සෛලයට ප්ලාස්මබන්ධන ඔස්සේ
            ගමන් කරයි.{"\n"}
            {"\n"}පටල හරහා සම්ප්‍රේෂණ මාර්ගය : ජලය හා ඛනිජ අයන එක් සෛලයකින්
            ප්ලාස්ම පටලය ඔස්සේ පිටතට පැමිණ ඊළඟ සෛලය ප්ලාස්ම පටලය හරහා නැවත ඇතුළට
            ගමන් කරයි.එහිදී නැවත නැවත ප්ලාස්ම පටලය හරහා ජලය හා ද්‍රව්‍ය ගමන්
            කරයි.පාංශු ද්‍රාවණය ඇපොප්ලාස්ටය ඔස්සේ ගමන් කරන විට සමහර ඛනිජ අයන හා
            ජලය කොටසක් අපිචර්මීය හා බාහික සෛලවල ප්‍රාක් ප්ලාස්ටයට ඇතුළුවී
            සිම්ප්ලාස්ටය ඔස්සේ ගමන් කරයි.සමහර ද්‍රව්‍ය වලට එක් මාර්ගයකට වඩා වැඩි
            මාර්ග ප්‍රමාණයක් භාවිතා කළ හැකිය. පරිවහනයට අවම ප්‍රතිරෝධය ඇත්තේ
            ඇපොප්ලාස්ට මාර්ගයයි.ඒ නිසා වැඩි වශයෙන් ජලය පරිවහනය කරනු ලබන්නේ
            ඇපොප්ලාස්ට මාර්ගය ඔස්සේය.අවසානයේ දී ජලය හා ඛනිජ සෛලමයේ වාහිනී ඒකක හා
            වාහකාභ තුලට ඇතුළු වේ.ජල සන්නයනයට දායක වන සෛල පරිණත වන විට ප්‍රාක්
            ප්ලාස්ටය නොදරයි.ඒ නිසා ඒවා පරිණත වන විට ඇපොප්ලාස්ටයේ කොටස් බවට
            පත්වේ.අන්තශ්චර්මීය සෛල හා සනාල පටකයේ සජීවී සෛලවල ප්‍රාක්ප්ලාස්ටයේ
            සිට තම සෛල බිත්තිවලට ඛනිජ අයන මුදාහරී.සිම්ප්ලාස්ටයේ සිට ඇපොප්ලාස්ටයට
            ද්‍රාව්‍ය ගමන් කිරීමට විසරණය හා සක්‍රීය පරිවහනය දායක වේ.එවිට ජලය හා
            ඛනිජ අයන වාහිනීඒකක හා වාහකාභ තුළට ඇතුළු වී ඇපොප්ලාස්ටය ඔස්සේ පමණක්
            තොග ප්‍රවාහයක් ලෙස ප්‍රරෝහ පද්ධතිය දක්වා පරිවහනය වේ.
          </Text>
        </View>
        {/* Lesson Note End */}

        {/* Lesson Note End */}
      </ScrollView>
      <StatusBar style="dark" />
    </SafeAreaView>
  );
};

export default Les4Sub14;
