import {
  View,
  Text,
  SafeAreaView,
  Image,
  TouchableOpacity,
  ScrollView,
} from "react-native";
import React, { useLayoutEffect } from "react";
import { useNavigation } from "@react-navigation/native";
import { Back, BackBox, BackBox2, Hero1, Hero2 } from "../../assets";

const Les2Sub22 = () => {
  const navigation = useNavigation();

  useLayoutEffect(() => {
    navigation.setOptions({
      headerShown: false,
    });
  }, []);

  return (
    <SafeAreaView className="relative flex-1 pt-10 bg-white">
      <ScrollView vertical={true} showsVerticalScrollIndicator={false}>
        {/* Back Button start */}
        <View className="px-3 h-14">
          <View className="flex-row">
            <TouchableOpacity
              className="items-center"
              onPress={() => navigation.navigate("Lesson2")}
            >
              <Image source={BackBox2} width={200} height={30} />
            </TouchableOpacity>
          </View>
        </View>
        {/* Back Button End */}

        {/* Lesson name banner start */}
        <View className="h-20 bg-[#de8212] flex-col justify-center">
          <View className="flex-row px-3">
            <View className="w-2 bg-white h-14"></View>
            <View className="flex-col px-2">
              <Text className="flex flex-col justify-center text-lg font-bold text-white">
                ජීවයේ රසායනික හා සෛලීය පදනම
              </Text>
              <Text className="flex flex-col justify-center mt-1 text-sm font-semibold text-slate-100">
                පාඩම් අංක 02
              </Text>
            </View>
          </View>
        </View>
        {/* Lesson Banner end */}

        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            ප්‍රභා ශ්වසනයේ අහිතකර බලපෑම් සහ එය අවම කරගැනීම සදහා ශාක විසින්
            ඇතිකරගත් අනුවර්තනයක් ලෙස C4 පථයේ දායකත්වය විස්තර කරන්න.
          </Text>
        </View>
        {/* Lesson Category end */}

        {/* Lesson Note Start */}
        <View className="py-3">
          <Text className="px-3 mt-2 mb-3 text-base font-semibold text-justify text-gray-800">
            රුබිස්කෝ එන්සයිමය මගින් විශිෂ්ට ප්‍රතික්‍රියා දෙකක් උත්ප්‍රේරණය
            කරයි.{"\n"}
            {"\n"}කාබොක්සිලේස් හා ඔක්සිජිනේස් ලෙස ක්‍රියා කරයි.{"\n"}
            {"\n"}ඔක්සිජිනේස් ප්‍රතික්‍රියාවේදී රුබිස්කෝ එන්සයිමය සමාන උපස්තරයක්
            ලෙස RUBP භාවිතා කළද එය ප්‍රතික්‍රියා කරන්නෙ O2 සමගිනි .{"\n"}
            {"\n"}
            කාබොක්සිලේස් එන්සයිමය ප්‍රතික්‍රියා උත්ප්‍රේරණයට ක්‍රියාත්මක වූ RUBP
            වල ඇති,සක්‍රීය ස්ථානයම ඔක්සිජනේස් ප්‍රතික්‍රියා උත්ප්‍රේරණය සදහා
            යොදා ගනියි.{"\n"}
            {"\n"}එනම් CO2 හා O2 තරගකාරීව කරන උපස්තර වේ.{"\n"}
            {"\n"}CO2 ඔක්සිජනේස් ප්‍රතික්‍රියාවට නිශේධකයක් ලෙසත් O2 කාබොක්සිලේස්
            ප්‍රතික්‍රියාවට නිශේධකයක් ලෙසත් ක්‍රියා කරයි.{"\n"}
            {"\n"}
            ඔක්සිජනේස් ප්‍රිතික්‍රියාවේදී 3PGA එක් අණුවක් ද,කාබන් දෙකක
            සං‍යුතියෙන් යුත් 2- පොස්ෆොග්ලයිකොලේට් අණුවක්ද සාදයි.{"\n"}
            {"\n"}කාබන් දෙකකින් යුක්ත සං‍යෝගය හරිතලව හැර යන අතර, එය පෙරොක්සිසෝමය
            හා මයිටොකොන්ඩ්‍රියා තුළදී සැකසීමට (Processed) ලක් වේ.{"\n"}
            {"\n"}ප්‍රභා ශ්වසනය සදහා හරිතලව,මයිටොකොන්ඩ්‍රියම හා පෙරොක්සිසෝම තුල
            ඇති එන්සයිම දායක වෙයි.{"\n"}
            {"\n"}ප්‍රභා ශ්වසනය ශක්ති අවශෝෂණය ඉලක්ක කරගත් ක්‍රියාවලියක් නොවන අතර
            {"\n"}
            {"\n"}CO2 වෙනුවට O2 භාවිතා කළ විට CO2 භාවිතා කරන සෑම වාරයකටම වඩා 50%
            කින් ශාකය 3PGA නිපදවන ප්‍රමාණය අඩුවෙයි.{"\n"}
            {"\n"}තවද ශුද්ධ CO2 හානියකට මග පාදයි.{"\n"}
            {"\n"}ඒනිසා ප්‍රභාසංස්ලේෂණයේදී ශුද්ධ C ලාභය ඉවත්වීම හා නිෂ්පාදකතාවය
            අඩුවීම සිදු වේ.{"\n"}
            {"\n"}ප්‍රභාසංස්ලේෂණයට අවශ්‍ය CO2 පූටිකා ඔස්සේ පත්‍ර තුළට ඇතුළු වේ.
            {"\n"}
            {"\n"}උත්ස්වේදනය සිදුවන ප්‍රධාන මාර්ගයක් වන්නේද පූටිකාය.{"\n"}
            {"\n"} උණුසුම් , වියළි දිනවල , ජල සං‍රක්ෂණය උදෙසා බොහෝ ශාකවල පූටිකා
            වැසීයයි.{"\n"}
            {"\n"}ඒ අතරම ,ආලෝක ප්‍රතික්‍රියාවෙන් O2 නිදහස් වීම වැඩිවීම ඇරඹේ.
            {"\n"}
            {"\n"}
            මෙය සයිටොසොලයේ CO2 : O2 අනුපාතය තවදුරටත් අඩුවීමට මග පාදයි.{"\n"}
            {"\n"}ඉහළ උෂ්ණත්ව , වියළි බව අධික අලෝක තීව්‍රතාව යටතේ ශාක පත්‍ර තුළ
            ඇතිවන මේ තත්ත්ව ප්‍රභාශ්වසනය නම් නිශ්ඵල ක්‍රියාවලිවලට හිතකර වේ.
            {"\n"}
            {"\n"}
            ශාක පරිණාමයේදී මේ තත්ත්වයට මුහුණ දීමට විවිධාකාරයෙන් සූදානම් වූ අතර
            එහි ප්‍රතිඵලයක් ලෙස රුබිස්කෝ එන්සයිමය වටා CO2 සාන්ද්‍රණය වැඩිකර
            ගැනීමට C4 ප්‍රභාසංස්ලේෂණ ඵතයට හැකි විය.{"\n"}
            {"\n"}C4 ප්‍රභසංස්ලේෂණ ඵතයේ දී රුබිස්කෝ එන්සයිමය අවට CO2 සාන්ද්‍රණය
            ඉහළ මට්ටමක තබා ගැනීම සදහා ශාක තුල විවිධ ජෛව රසායනික හා ව්‍යුහ
            විද්‍යාත්මක විකරණයන්ද සිදු වී ඇත.{"\n"}
            {"\n"}මෙමගින් C4 ශාකවල ඔක්සිජනේස් ප්‍රතික්‍රියාව හා ඉන්පසුව වන
            ප්‍රභා ශ්වසනය විශාල වශයෙන් අඩු වේ.{"\n"}
            {"\n"}බොහෝ C4 ශාකවල පැහැදිලිව විශේෂණය වූ සෛල වර්ග දෙකක් ඇත.{"\n"}
            {"\n"}
            එනම් පත්‍ර මධ්‍ය සෛල හා කලාප කොපු සෛල වශයෙනි .{"\n"}
            {"\n"}ඒ අතර ශ්‍රම විභාජනය වීමෙන් CO2 සාන්ද්‍රණයක් හැඩ ගැසී ඇත.{"\n"}
            {"\n"}
            C3 ශාක සමග සසදන විට C4 ශාක පත්‍රවල කලාප කොපු සෛල පුළුල් වශයෙන් කායික
            විද්‍යාත්මක හැඩගැසී ඇත.{"\n"}
            {"\n"}C4 ශාකවල මේ සෛල සාපේක්ෂව විශාල වී ඉහළ ඉන්ද්‍රිකා ප්‍රමාණයක්
            අන්තර්ගත වීමෙන් එය පෙන්වයි.{"\n"}
            {"\n"}C4 මාර්ගය කාර්යක්ෂම කිරීමට පත්‍ර මාධ්‍ය සෛල හා කලාප කොපු සෛල
            අතර තදින් සම්බන්ධව පවතින විශාල ප්ලාස්ම බන්ධ සංඛ්‍යාවක් මගින් අන්තර්
            සම්බන්ධතා පවත්වා ගනී.{"\n"}
            {"\n"}සනාල කලාප වට කරමින් කලාප කොපු සෛල පිහිටයි.ඊට පිටතින් පත්‍ර
            සෛලවලින් වට වී ඇති ඊට පිටතින් පත්‍ර මධ්‍ය සෛලවලින් වට වී ඇති මෙම පටක
            ව්‍යුහය ක්‍රාන්ස් පටක ව්‍යුහය නම් වේ.{"\n"}
            {"\n"}මෙම කලාප කොපු සෛල තුළ අධික CO2 සාන්ද්‍රණයක් රුබිස්කෝ එන්සයිමය
            ක්‍රියා කරයි.{"\n"}
            {"\n"}ඒ නිසා රුබිස්කෝ C3 ශාකවලට වඩා වැඩි කාර්යක්ෂමතාවයකින් ක්‍රියා
            කරයි.{"\n"}
            {"\n"}ජල හානිය අවම කර ගැනීම සදහා පූටිකා වැසී තිබියදීත් අවශ්‍ය
            තරම් CO2 සාන්ද්‍රණයක් ලබා ගැනීමට හැකියාවක් CO2 සාන්ද්‍රණය යන්ත්‍රණය
            නිසා C4 ශාකවලට ඇත.
          </Text>
        </View>
        {/* Lesson Note End */}
        {/* Lesson Note End */}
      </ScrollView>
    </SafeAreaView>
  );
};

export default Les2Sub22;
