import {
  View,
  Text,
  SafeAreaView,
  Image,
  TouchableOpacity,
  ScrollView,
} from "react-native";
import React, { useLayoutEffect } from "react";
import { useNavigation } from "@react-navigation/native";
import { Back, BackBox, BackBox2, Hero1, Hero2 } from "../../assets";

const Les2Sub11 = () => {
  const navigation = useNavigation();

  useLayoutEffect(() => {
    navigation.setOptions({
      headerShown: false,
    });
  }, []);

  return (
    <SafeAreaView className="relative flex-1 pt-10 bg-white">
      <ScrollView vertical={true} showsVerticalScrollIndicator={false}>
        {/* Back Button start */}
        <View className="px-3 h-14">
          <View className="flex-row">
            <TouchableOpacity
              className="items-center"
              onPress={() => navigation.navigate("Lesson2")}
            >
              <Image source={BackBox2} width={200} height={30} />
            </TouchableOpacity>
          </View>
        </View>
        {/* Back Button End */}

        {/* Lesson name banner start */}
        <View className="h-20 bg-[#de8212] flex-col justify-center">
          <View className="flex-row px-3">
            <View className="w-2 bg-white h-14"></View>
            <View className="flex-col px-2">
              <Text className="flex flex-col justify-center text-lg font-bold text-white">
                ජීවයේ රසායනික හා සෛලීය පදනම
              </Text>
              <Text className="flex flex-col justify-center mt-1 text-sm font-semibold text-slate-100">
                පාඩම් අංක 02
              </Text>
            </View>
          </View>
        </View>
        {/* Lesson Banner end */}

        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            න්‍යෂ්ටිය පිළිබඳ කෙටි සටහන්.
          </Text>
        </View>
        {/* Lesson Category end */}

        {/* Lesson Note Start */}
        <View className="py-3">
          <Text className="px-3 mt-2 mb-5 text-base font-semibold text-justify text-gray-800">
            සාමාන්‍ය විශ්කම්භය 5 මයික්‍රෝමීටර් වේ.{"\n"}
            {"\n"}න්‍යෂ්ටි ආවරණය ලෙස හදුන්වන ද්විත්ව පටලයකින් ආවරණය වූ ද බොහෝ
            ජානවලින් සමන්විත කැපී පෙනෙන ඉන්ද්‍රිකාවකි.{"\n"}
            {"\n"}න්‍යෂ්ටි ආවරණය :{"\n"}
            පිටත පටලය හා ඇතුළත පටලය ලෙස හදුන්වන පටල දෙකකින් සමන්විතය.
            {"\n"}
            පටල දෙක 20 -40 නැනෝමීටර් පමණ ප්‍රමාණයේ අවකාශයකින් වෙන්ව ඇත.{"\n"}
            ද්‍රව්‍ය ඇතුළුවීම සහ පිටවීම යාමනය කිරීමට ඇති සිදුරු සංකීර්ණා සහිත
            න්‍යෂ්ටික සිදුරු මගින් න්‍යෂ්ටි ආවරණය සජිද්‍ර වී ඇත.{"\n"}
            න්‍යෂ්ටි ආවරණයේ ඇතුළත ආස්තරණය කරන ප්‍රෝටීන සූත්‍රිකාවලින් සෑදුණු
            න්‍යෂ්ටික තලාව ඇත.{"\n"}
            {"\n"}න්‍යෂ්ටික පූරකය :{"\n"}න්‍යෂ්ටිය අභ්‍යන්තරයෙන් විහිදුණු
            ප්‍රෝටීන සූත්‍රිකාවලින් න්‍යෂ්ටි පූරකය තැනී ඇත.{"\n"}න්‍යෂ්ටි පූරකයේ
            ක්‍රොමැටීන් හා න්‍යෂ්ටිකාව ගිලී ඇත.{"\n"}න්‍යෂ්ටිකාව ක්‍රොමැටීන්වලට
            ආසන්නව ඇති තදින් වර්ණ ගැන්වූ තන්තු සහිත කණිකා ලෙස දිස් වේ.{"\n"}
            {"\n"}
            ක්‍රොමැටීන් ජාලය :{"\n"}ඉලෙක්‍රෝන අණ්වීෂීය ඡායාරූපවලට (micrographs)
            අනුව විභාජනය නොවන සෛල තුළ විසිරුණු ගොනුවක් ලෙස දිස් වේ.{"\n"}DNA හා
            ප්‍රෝටීන සංකීරණයකි.{"\n"}න්‍යෂ්ටි විභාජනය වන විට ක්‍රොමැටීන් ඝන වී
            තදින් දගර ගැසී වර්ණදේහ ලෙස හදුන්වන නූල් වැනි ව්‍යුහ බවට පත් වේ.
            {"\n"}
            {"\n"}
            එක් ජීවි විශේෂයක් තුල නියත වර්ණදේහ සංඛ්‍යාවක් ඇත. උදා-දර්ශීය මානව
            සෛලයක වර්ණදේහ 46 ක් ඇත.{"\n"}
            {"\n"}සියලු සෛලීය ක්‍රියාවලි පාලනය කරයි.
            {"\n"}
            {"\n"}
            සෛල විභාජනයට නව න්‍යෂ්ටි නිපදවීමට DNA සංස්ලේෂණය කරයි.{"\n"}
            {"\n"}ප්‍රෝටීන සංස්ලේෂනයට අවශ්‍ය වන rRNA සහ රයිබොසෝම උප ඒකක
            න්‍යෂ්ටිකාව මගින් සංස්ලේෂණය කරයි.{"\n"}
            {"\n"}DNA වල ඇති තොරතුරුවලට අනුව m RNA හා t RNA සංස්ලේෂණය කරයි.
            {"\n"}
            {"\n"}
            ප්‍රවේණික තොරතුරු ගබඩා කිරීම හා සම්ප්‍රේෂණය.
          </Text>
        </View>

        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            අන්තඃපටල පද්ධතිය පිළිබඳ කෙටි සටහන්.
          </Text>
        </View>
        {/* Lesson Category end */}

        {/* Lesson Note Start */}
        <View className="py-3">
          <Text className="px-3 mb-5 text-base font-semibold text-justify text-gray-800">
            සූන්‍යෂ්ටික සෛලයක පවතින පටලයකින් වට වූ ඉන්ද්‍රියිකා රැසක් මීට අයත්
            වේ.{"\n"}
            {"\n"} න්‍යෂ්ටික ආවරණය,අන්තඃප්ලාස්ම ජාලිකාව,ගෝල්ගි උපකරණය,
            ලයිසොසෝම,විවිධ ආශයිකා වර්ග,විවිධ රික්තක වර්ග,ප්ලාස්ම පටලය යන සංඝටක
            අන්තඃපටල පද්ධතියට අයත්ය.{"\n"}
            {"\n"}මෙම පද්ධතියට අයත් සංඝටකවල පටල භෞතිකව සෘජුව එකිනෙක සමග සම්බන්ධ
            වීම හෝ ආශයිකා හරහා සම්බන්ධ වීමද සිදු වේ.{"\n"}
            {"\n"}මෙම පද්ධතියට අයත් සංඝටකවල ව්‍යුහය මෙන්ම කෘත්‍යද එකිනෙක වෙනස්ය.
            {"\n"}
            {"\n"}ප්‍රෝටීන සංස්ලේෂණයට දායක වේ.{"\n"}
            {"\n"}ඉන්ද්‍රියිකා තුලට හා සෛලවලින් ඉවතට ප්‍රෝටීන පරිවහනය.{"\n"}
            {"\n"}
            ලිපිඩ පරිවෘත්තීය හා පරිවහනය විෂහරණ කෘත්‍යයන්ට දායක වේ.{"\n"}
            {"\n"}න්‍යෂ්ටි ආවරණය අඛණ්ඩව RER හා SER සමග සම්බන්ධව පවතී.{"\n"}
            {"\n"}ER මගින් නිපදවෙන පටල කොටස් හා ප්‍රෝටීන පරිවහන ආශයිකා හරහා
            ගෝල්ගි උපකරණයේ cis පෘෂ්ටය වෙතට යැවීම{"\n"}
            {"\n"}ගෝල්ගි උපකරණය මගින් ප්‍රෝටීන විකරණය කර ඒවා ආශයිකා තුළ ඇසිරීම.
            {"\n"}
            {"\n"}Trans මුහුණතෙන් කපාහරින ස්‍රාවී ආශයිකා සෛලයේ ප්ලාස්ම පටලය වෙතට
            ගමන් කර,ඒ සමග බැදී සෛලයෙන් ඉවතට ද්‍රව්‍ය ස්‍රාවය කරයි.
          </Text>
        </View>
        {/* Lesson Categories Start */}
        <View className="px-3 bg-gray-300">
          <Text className="py-3 text-base font-bold text-gray-800">
            ශාක සෛල බිත්තිය පිළිබඳ කෙටි සටහන්.
          </Text>
        </View>
        {/* Lesson Category end */}
        {/* Lesson Note Start */}
        <View className="py-3">
          <Text className="px-3 mb-5 text-base font-semibold text-justify text-gray-800">
            ශාක සෛලවල ඇති බහිස්සෛලීය ව්‍යුහයකි.{"\n"}
            {"\n"}විශේෂයෙන් විශේෂයටත් එකම ශාකයේ සෛල වර්ග අතරත් සෛල බිත්තියේ
            රසායනික සං‍යුතිය අධිකව වෙනස් වේ.{"\n"}
            {"\n"}සාමාන්‍යයෙන් ශාක සෛල බිත්ති සෑදී ඇත්තේ සෙලියුලෝස් පෙක්ටීන් හා
            හෙම්සෙලියුලෝස්වලිනි.{"\n"}
            {"\n"}ලිග්නීන් හා සුබෙරීන් සමහර ශාක සෛලවල පමණක් ඇත.{"\n"}
            {"\n"}ප්‍රථමික සෛල බිත්තිය හා ද්විතීක සෛල බිත්ති ලෙස ශාකවල සෛල
            බිත්ති වර්ග දෙකකි.{"\n"}
            {"\n"}ළපටි සෛලවල පළමුව ස්‍රාවය වන්නේ ප්‍රාථමික සෛල බිත්තියයි.{"\n"}
            {"\n"}
            එය ශාක සෛලවල සෛල විභාජනයේදී තැන්පත්වන බිත්තියයි.{"\n"}
            {"\n"}ප්‍රාථමික සෛල බිත්තියට වහාම පිටතින් පෙක්ටීන් ලෙස හදුන්වන
            ඇලෙනසුලු පොලිසැකරයිඩයකින් පොහොසත් (මැග්නීසියම් සහ කැල්සියම්
            පෙක්ටේට්) තුනී ස්තරයක් ලෙස මධ්‍ය සූස්තරයක් ඇත.{"\n"}
            {"\n"}මධ්‍ය සූස්තරය මගින් යාබද සෛල එකට අලවා තබා ගනියි.{"\n"}
            {"\n"}
            ප්‍රාථමික සෛල බිත්තිය මත දකාරක ද්‍රව්‍ය තැම්පත් වීම නිසා ද්විතීක
            බිත්තිය ද්විතීකව ඇති වේ.{"\n"}
            {"\n"}ප්‍රාථමික සෛල බිත්තිය පාරගම්‍ය සාපේක්ෂව තුනී , නම්‍යශීලීය.
            {"\n"}
            {"\n"}
            ප්‍රධාන වශයෙන් සෙලියුලෝස් තන්තුවලින් සමන්විත වන අතර මධ්‍ය සූස්තරය මත
            තැන්පත් වී ඇත.{"\n"}
            {"\n"}සෛල බිත්තියේ ඇති නිදහස් අවකාශය තුළින් ජලය නිදහසේ ගමන් කළ
            හැකිය.{"\n"}
            {"\n"}ද්විතීක බිත්තිය තැම්පත් වන්නේ ප්ලාස්ම පටලය හා ප්‍රාථමික සෛල
            බිත්තිය අතරය.{"\n"}
            {"\n"}එය තද ද්‍රව්‍යවලින් සෑදුණු ස්තර කිහිපයකින් යුක්ත දෘඩ
            ව්‍යුහයකි.{"\n"}
            {"\n"}සෙලියුලෝස්වලට අමතරව ලිග්නීන් සුබෙරීන් වැනි අපාරගම්‍ය වූ ද්‍රවය
            ද්විතීක බිත්තියට අන්තර්ග වේ.{"\n"}
            {"\n"}ලිග්නීන් බදාම මගින් සෙලියුලෝස් තන්තු එකට රදවා තබාගෙන දෘඩ
            පූරකයක් සාදන අතර සෛල බිත්තියට අමතර සන්ධාරණයක් ලබාදෙයි.{"\n"}
            {"\n"}සෛල බිත්තියේ ඇති කූ හරහා විහිදෙන ප්ලාස්ම බන්ධ මගින් යාබද සෛලවල
            සෛල ප්ලාස්ම සම්බන්ධ කරයි.{"\n"}
            {"\n"}ආරක්ෂාව හා සන්ධාරණය සෛලයට ජලය ඇතුළුවන විට ශූනතාව වැඩිවීමට ඉඩ
            දෙයි.{"\n"}
            {"\n"}ශූනතාවයේදී සෛල පිපිරීම වළක්වයි.{"\n"}
            {"\n"}සෛල වර්ධනය පාලනය හා සීමා කරයි.{"\n"}
            {"\n"}ඇපොප්ලාස්ට මාර්ගයේ සංඝටකයකි.{"\n"}
            {"\n"}සෛල හැඩය පවත්වා ගනී.{"\n"}
            {"\n"}ගුරුත්ව බලයට එරෙහිව ශාකය සෘජුව දරා සිටියි.
          </Text>
        </View>
        {/* Lesson Note End */}
      </ScrollView>
    </SafeAreaView>
  );
};

export default Les2Sub11;
